Revit 2024 API
BuiltInFailures.ElementFailures Class
 Failures about Elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class ElementFailures
Visual Basic
Public NotInheritable Class ElementFailures
Visual C++
public ref class ElementFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ElementFailures
See Also
BuiltInFailures.ElementFailures Members
Autodesk.Revit.DB Namespace